import React from "react";

export default function Advertising() {
  return (
    <section id="Advertising" className="bg-[#F6EBDA]">
      {/* Advertising Container */}
      <div className="container mx-auto flex max-w-[1440px] flex-col items-center px-6 pt-24 pb-32 lg:flex-row md:space-x-16">

        {/* Content - Left */}
        <div className="flex flex-col items-start md:w-1/2">

          {/* Heading */}
          <div className="mr-4 flex flex-col">
            <h4 className="mb-4 max-w-md text-3xl font-bold md:text-5xl">
              مشاهده نظرات کاربران
            </h4>

            <p className="text-md md:mr-8">
              گوشه‌ای از نظرات کاربران که ممکن است برایتان مفید باشد
            </p>
          </div>

          {/* BOX 1 */}
          <div className="mx-auto mt-16 h-[430px] w-80 bg-white md:w-96">

            {/* Quote Icon */}
            <svg
              className="mt-8 mr-4"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="13"
              viewBox="0 0 16 13"
              fill="none"
            >
              <g clipPath="url(#clip0_283_2153)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M15.9298 2.03037C13.5439 3.15836 12.351 4.48372 12.351 6.00651C13.3679 6.11931 14.2088 6.5188 14.8738 7.20499C15.5387 7.89118 15.8712 8.68546 15.8712 9.58785C15.8712 10.5466 15.5485 11.355 14.9031 12.013C14.2577 12.671 13.4461 13 12.4683 13C11.3731 13 10.4246 12.5723 9.62279 11.7169C8.82096 10.8615 8.42005 9.82285 8.42005 8.60087C8.42005 4.93491 10.5517 2.06798 14.8151 0L15.9298 2.03037ZM7.50978 2.03037C5.10429 3.15836 3.90156 4.48372 3.90156 6.00651C4.93808 6.11931 5.78878 6.5188 6.45372 7.20499C7.11865 7.89118 7.45111 8.68546 7.45111 9.58785C7.45111 10.5466 7.12354 11.355 6.46838 12.013C5.81323 12.671 4.99675 13 4.0189 13C2.92372 13 1.98012 12.5723 1.18807 11.7169C0.39602 10.8615 0 9.82285 0 8.60087C0 4.93491 2.12188 2.06798 6.36571 0L7.50978 2.03037Z"
                  fill="#B87651"
                />
              </g>

              <defs>
                <clipPath id="clip0_283_2153">
                  <rect width="16" height="13" fill="white" />
                </clipPath>
              </defs>
            </svg>

            {/* Text */}
            <div className="mx-auto m-8 mt-0 w-60 text-justify">
              <p>
                استفاده از این اپلیکیشن را از آن جهت توصیه میکنم که نمایش
                اطلاعات دقیق کافه، منو و نظرات دیگران به صورت جامع، تصمیم گیری
                را برای مشتری اسان کرده و باعث تجربه خوب مشتری می‌شود.
                <br />
                علاوه بر این موضوع، ثبت نام در این اپ باعث معرفی کافه ما شد و
                تعداد مشتریانمان به طور قابل توجهی افزایش یافت.
                <br />
              </p>

              <h1 className="mt-14 text-lg font-bold">
                کافه تلخ
              </h1>

              <p className="text-base text-gray-500">
                مدیر کافه
              </p>
            </div>
          </div>
        </div>

        {/* Content - Right */}
        <div className="flex flex-col">

          {/* BOX 2 */}
          <div className="mx-auto mt-5 h-[460px] w-80 max-w-[1440px] bg-white lg:h-[420px] lg:w-[432px]">

            {/* Quote Icon */}
            <svg
              className="mt-8 mr-4"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="13"
              viewBox="0 0 16 13"
              fill="none"
            >
              <g clipPath="url(#clip0_283_2153)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M15.9298 2.03037C13.5439 3.15836 12.351 4.48372 12.351 6.00651C13.3679 6.11931 14.2088 6.5188 14.8738 7.20499C15.5387 7.89118 15.8712 8.68546 15.8712 9.58785C15.8712 10.5466 15.5485 11.355 14.9031 12.013C14.2577 12.671 13.4461 13 12.4683 13C11.3731 13 10.4246 12.5723 9.62279 11.7169C8.82096 10.8615 8.42005 9.82285 8.42005 8.60087C8.42005 4.93491 10.5517 2.06798 14.8151 0L15.9298 2.03037ZM7.50978 2.03037C5.10429 3.15836 3.90156 4.48372 3.90156 6.00651C4.93808 6.11931 5.78878 6.5188 6.45372 7.20499C7.11865 7.89118 7.45111 8.68546 7.45111 9.58785C7.45111 10.5466 7.12354 11.355 6.46838 12.013C5.81323 12.671 4.99675 13 4.0189 13C2.92372 13 1.98012 12.5723 1.18807 11.7169C0.39602 10.8615 0 9.82285 0 8.60087C0 4.93491 2.12188 2.06798 6.36571 0L7.50978 2.03037Z"
                  fill="#B87651"
                />
              </g>

              <defs>
                <clipPath id="clip0_283_2153">
                  <rect width="16" height="13" fill="white" />
                </clipPath>
              </defs>
            </svg>

            <div className="mx-auto m-8 mt-0 w-60 text-justify lg:w-72">
              <p>
                من هر چند وقت یکبار برای تنوع محیط کاریم رو عوض میکنم و معمولا
                انتخابم کافه هست. من عاشق این اپ شدم چون خیلی راحت تایم های
                خلوت تر کافه های نزدیک به خودم رو می بینم و چند ساعتی مشغول به
                کار میشم.
                <br />
                در ضمن در لیست کافه های پیشنهادی اپ، یک کافه جدید پیدا کردم که
                علاوه بر قهوه خیلی خوبشون، محیط بسیار دوستانه و صمیمی داشتن که
                برام تجربه خیلی خوبی بود.
              </p>

              <h1 className="mt-4 text-lg font-bold">
                حمیدرضا
              </h1>

              <p className="text-base text-gray-500">
                کاربر گوشه‌ی دنج
              </p>
            </div>
          </div>

          {/* BOX 3 */}
          <div className="mx-auto mt-5 h-72 w-80 bg-white md:mt-16 md:mr-0 lg:w-96">

            {/* Quote Icon */}
            <svg
              className="mt-8 mr-3 md:mr-8"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="13"
              viewBox="0 0 16 13"
              fill="none"
            >
              <g clipPath="url(#clip0_283_2153)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M15.9298 2.03037C13.5439 3.15836 12.351 4.48372 12.351 6.00651C13.3679 6.11931 14.2088 6.5188 14.8738 7.20499C15.5387 7.89118 15.8712 8.68546 15.8712 9.58785C15.8712 10.5466 15.5485 11.355 14.9031 12.013C14.2577 12.671 13.4461 13 12.4683 13C11.3731 13 10.4246 12.5723 9.62279 11.7169C8.82096 10.8615 8.42005 9.82285 8.42005 8.60087C8.42005 4.93491 10.5517 2.06798 14.8151 0L15.9298 2.03037ZM7.50978 2.03037C5.10429 3.15836 3.90156 4.48372 3.90156 6.00651C4.93808 6.11931 5.78878 6.5188 6.45372 7.20499C7.11865 7.89118 7.45111 8.68546 7.45111 9.58785C7.45111 10.5466 7.12354 11.355 6.46838 12.013C5.81323 12.671 4.99675 13 4.0189 13C2.92372 13 1.98012 12.5723 1.18807 11.7169C0.39602 10.8615 0 9.82285 0 8.60087C0 4.93491 2.12188 2.06798 6.36571 0L7.50978 2.03037Z"
                  fill="#B87651"
                />
              </g>

              <defs>
                <clipPath id="clip0_283_2153">
                  <rect width="16" height="13" fill="white" />
                </clipPath>
              </defs>
            </svg>

            <div className="mx-auto m-8 mt-0 w-64 text-justify">
              <p>
                عالیه، با استفاده از این اپ کافه‌های جدیدی رو پیدا کردم که قبلا
                حتی فکرشو نمی کردم، نظرات و تجربیات دیگران هم خیلی بهم کمک کرد.
                حتما پیشنهاد میکنم ازش استفاده کنید.
              </p>

              <h1 className="mt-8 text-lg font-bold">
                سارا
              </h1>

              <p className="text-base text-gray-500">
                کاربر گوشه‌ی دنج
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}